Autodesk.Revit.Utility.AssetType
An enumerated to list Asset Types in Revit.

Autodesk.Revit.Utility.AssetType.Content
Content assets (RPC / entourage).

Autodesk.Revit.Utility.AssetType.Appearance
Appearance assets (materials).